#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]: Refreshing state... [id=E3R7ITY1ZA9AK3]
aws_cloudfront_function.append_index: Refreshing state... [id=append-index]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:004351562122:certificate/bd2e1a9e-6d23-49b3-a35b-80c428772da3]
data.aws_route53_zone.selected: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.logs: Refreshing state... [id=serverlessbio-logs-us-east-1-004351562122-prod]
aws_s3_bucket.domain: Refreshing state... [id=serverlessbio-us-east-1-004351562122-prod]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=serverlessbio-logs-us-east-1-004351562122-prod]
aws_s3_bucket_logging.domain: Refreshing state... [id=serverlessbio-us-east-1-004351562122-prod]
aws_s3_bucket_policy.logs: Refreshing state... [id=serverlessbio-logs-us-east-1-004351562122-prod]
data.aws_route53_zone.selected: Read complete after 0s [id=Z03189763RZCA5U9KR8I7]
aws_route53_record.acm["*.serverlessbio.com"]: Refreshing state... [id=Z03189763RZCA5U9KR8I7__b886d3340bd4600147b9f1fc72c7bfb8.serverlessbio.com._CNAME]
aws_route53_record.acm["serverlessbio.com"]: Refreshing state... [id=Z03189763RZCA5U9KR8I7__b886d3340bd4600147b9f1fc72c7bfb8.serverlessbio.com._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-07-16 19:33:26.032 +0000 UTC]
module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
aws_route53_record.domain: Refreshing state... [id=Z03189763RZCA5U9KR8I7_serverlessbio.com_A]
aws_route53_record.subdomain: Refreshing state... [id=Z03189763RZCA5U9KR8I7_www.serverlessbio.com_A]
aws_s3_bucket_policy.domain: Refreshing state... [id=serverlessbio-us-east-1-004351562122-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cloudfront.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E3AB5V8CH4QET7"
      ~ status                         = "InProgress" -> "Deployed"
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "004351562122",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "logging.s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.oac will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "oac" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_s3_bucket.domain must be replaced
-/+ resource "aws_s3_bucket" "domain" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::serverlessbio-us-east-1-004351562122-prod" -> (known after apply)
      ~ bucket                      = "serverlessbio-us-east-1-004351562122-prod" -> "serverless-bio-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "serverlessbio-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "serverlessbio-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "serverlessbio-us-east-1-004351562122-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::serverlessbio-us-east-1-004351562122-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - logging {
          - target_bucket = "serverlessbio-logs-us-east-1-004351562122-prod" -> null
          - target_prefix = "s3/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.logs must be replaced
-/+ resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::serverlessbio-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ bucket                      = "serverlessbio-logs-us-east-1-004351562122-prod" -> "serverless-bio-logs-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "serverlessbio-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "serverlessbio-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "serverlessbio-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:s3:::serverlessbio-us-east-1-004351562122-prod"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "004351562122"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::serverlessbio-logs-us-east-1-004351562122-prod/s3/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      - grant {
          - id          = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_logging.domain must be replaced
-/+ resource "aws_s3_bucket_logging" "domain" {
      ~ bucket        = "serverlessbio-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id            = "serverlessbio-us-east-1-004351562122-prod" -> (known after apply)
      ~ target_bucket = "serverlessbio-logs-us-east-1-004351562122-prod" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_ownership_controls.logs must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "logs" {
      ~ bucket = "serverlessbio-logs-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "serverlessbio-logs-us-east-1-004351562122-prod" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.domain must be replaced
-/+ resource "aws_s3_bucket_policy" "domain" {
      ~ bucket = "serverlessbio-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "serverlessbio-us-east-1-004351562122-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::serverlessbio-us-east-1-004351562122-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_policy.logs must be replaced
-/+ resource "aws_s3_bucket_policy" "logs" {
      ~ bucket = "serverlessbio-logs-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "serverlessbio-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:s3:::serverlessbio-us-east-1-004351562122-prod"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "004351562122"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::serverlessbio-logs-us-east-1-004351562122-prod/s3/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E3AB5V8CH4QET7"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ logging_config {
          ~ bucket          = "serverlessbio-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "serverlessbio-us-east-1-004351562122-prod.s3.amazonaws.com" -> null
          - origin_access_control_id = "E3R7ITY1ZA9AK3" -> null
          - origin_id                = "s3" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E3R7ITY1ZA9AK3"
          + origin_id                = "s3"
        }

        # (5 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*